# **INFERENCE - Classification Model for Predicting Client Default Payment Status**

**`Created by:`**

Michael Nathaniel

---
## **11. Model Inference**

Model yang sudah dilatih akan dicoba pada data yang bukan termasuk ke dalam train-set ataupun test-set. Data ini harus dalam format yang asli, bukan data yang sudah di-scaled.

### **11.1. Import Modul**

In [18]:
import pandas as pd
import pickle

### **11.2. Load Model**

Pertama-tama, kita akan meload model terlebih dahulu.

In [19]:
# Memuat Model

# Memuat model Linear Regression dari file pickle
with open('model_logistic_regression.pkl', 'rb') as file_5:
  model_logistic_regression = pickle.load(file_5)

### **11.3. Inference**

Kita akan membuat data baru yang berisikan informasi yang diperlukan oleh model untuk memprediksi.

In [20]:
# Membuat Data Baru

# Membuat data baru dengan informasi jarak, pengali lonjakan, dan nama armada
data_inf = {
    "limit_balance": [120000, 75000, 40000],
    "sex": [2, 2, 1],
    "education_level": [3, 2, 4],
    "marital_status": [3, 2, 1],
    "age": [27, 29, 35],
    "pay_1": [-1, 1, 3],
    "pay_2": [-1, -1, 2],
    "pay_3": [-1, -1, 1],
    "pay_4": [2, 4, 1],
    "pay_5": [3, 2, 1],
    "pay_6": [1, 2, 1],
    "bill_amt_1": [20000, 30000, 30000],
    "bill_amt_2": [5000, 2000, 35000],
    "bill_amt_3": [17000, 12000, 40000],
    "bill_amt_4": [0, 20000, 0],
    "bill_amt_5": [0, 0, 15000],
    "bill_amt_6": [50000, 70000, 30000],
    "pay_amt_1": [12000, 25000, 0],
    "pay_amt_2": [5000, 3000, 25000],
    "pay_amt_3": [0, 7000, 30000],
    "pay_amt_4": [0, 0, 5000],
    "pay_amt_5": [0, 0, 10000],
    "pay_amt_6": [45000, 60000, 15000]
}

# Membuat DataFrame dari data baru
data_inf = pd.DataFrame(data_inf)

# Menampilkan data baru
data_inf

,limit_balance,sex,education_level,marital_status,age,pay_1,pay_2,pay_3,pay_4,pay_5,...,bill_amt_3,bill_amt_4,bill_amt_5,bill_amt_6,pay_amt_1,pay_amt_2,pay_amt_3,pay_amt_4,pay_amt_5,pay_amt_6
0,120000,2,3,3,27,-1,-1,-1,2,3,...,17000,0,0,50000,12000,5000,0,0,0,45000
1,75000,2,2,2,29,1,-1,-1,4,2,...,12000,20000,0,70000,25000,3000,7000,0,0,60000
2,40000,1,4,1,35,3,2,1,1,1,...,40000,0,15000,30000,0,25000,30000,5000,10000,15000

In [21]:
# Memprediksi dengan Menggunakan Model Linear Regression

# Memprediksi target untuk data baru menggunakan model Linear Regression
y_pred_inf = model_logistic_regression.predict(data_inf)

# Menampilkan prediksi untuk data baru
y_pred_inf

array([0, 1, 1], dtype=int64)

### **11.4. Kesimpulan Inference**

Dari hasil uji model (inferential), kita peroleh bahwa dari ketiga inputan data kita, orang pertama dapat membayar untuk bulan selanjutnya, sedangkan dua orang lainnya terindikasi default payment untuk bulan selanjutnya (gagal bayar)